InformationRegisters/СтатусыПредставленийКНаградам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтатусыПредставленийКНаградам</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПредставленияКНаградам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВручения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставленКНаграде</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Награды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Награда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Награды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Награды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Награды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодОКИН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлассификатора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияНаграды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииНаград</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНаграды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьВТ2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторноеНаграждениеНеПредусмотрено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтсутствиеДисциплинарныхВзысканий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальныйВозраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйВозраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоблюдатьПоследовательностьНаграждения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МинимальныеСтажиРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатегорияСтажа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КатегорииСтажа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЛет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОграничениеДолжностей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОграничениеДолжности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнтервалыНаграждения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидНаграды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Награды</v8:Type>
								<v8:Type>cfg:CatalogRef.КатегорииНаград</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Интервал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаличиеНаград</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Награда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Награды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СтатусыПредставленийКНаградам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Возвращаемое значение:
// Структура, которая используется для передачи параметров в функцию ПредставленияКНаградам:
// 	* НаДату           - Дата, МоментВремени, Граница, на которые формируется СрезПоследних.
// 	* Организация      - Справочник.Организации.
// 	* КатегорияНаграды - Справочник.КатегорииНаград.
// 	* ФизическоеЛицо   - Массив физических лиц или одиночное значение типа СправочникСсылка.ФизическиеЛица.
// 	* Награда          - Массив наград или одиночное значение типа СправочникСсылка.Награды.
//
Функция ОписаниеПараметровСтатусыПредставленийКНаградам() Экспорт

	Параметры = Новый Структура;
	
	Параметры.Вставить("НаДату",           Дата(1,1,1));
	Параметры.Вставить("Организация",      Неопределено);
	Параметры.Вставить("КатегорияНаграды", Неопределено);
	Параметры.Вставить("ФизическоеЛицо",   Неопределено);
	Параметры.Вставить("Награда",          Неопределено);
	
	Возврат Параметры;

КонецФункции

// Возвращает статусы представлений к наградам сотрудников.
// 
// Параметры:
//  Параметры - см. ОписаниеПараметровСтатусыПредставленийКНаградам.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Статусы представлений к наградам сотрудников.
Функция СтатусыПредставленийКНаградам(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаДату", Параметры.НаДату);

	ШаблонУсловияОтбора = НСтр("ru='[ИмяИзмерения] В (&[ИмяПараметра])'");
	УсловияОтбора = Новый Массив;
	
	Для Каждого Параметр Из Параметры Цикл
		
		Если Параметр.Ключ = "НаДату" Тогда
			Продолжить;
		КонецЕсли;
		Если Параметр.Значение = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		ИмяПараметра = Параметр.Ключ;
		
		ЗначениеПараметра = Параметр.Значение;
		Если Не ТипЗнч(ЗначениеПараметра) = Тип("Массив") Тогда
			ЗначениеПараметра = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЗначениеПараметра);
		КонецЕсли;
		
		Запрос.УстановитьПараметр(ИмяПараметра, ЗначениеПараметра);
		
		ПараметрыШаблона = Новый Структура("ИмяИзмерения, ИмяПараметра", ИмяПараметра, ИмяПараметра);
		УсловияОтбора.Добавить(СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонУсловияОтбора, ПараметрыШаблона));
		
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПредставленияКНаградамСрезПоследних.Организация КАК Организация,
	|	ПредставленияКНаградамСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВЫРАЗИТЬ(ПредставленияКНаградамСрезПоследних.Награда КАК Справочник.Награды).КатегорияНаграды КАК КатегорияНаграды,
	|	ПредставленияКНаградамСрезПоследних.Награда КАК Награда,
	|	ПредставленияКНаградамСрезПоследних.Статус КАК Статус,
	|	ПредставленияКНаградамСрезПоследних.Период КАК Период,
	|	ПредставленияКНаградамСрезПоследних.НомерДокумента КАК НомерДокумента
	|ИЗ
	|	РегистрСведений.СтатусыПредставленийКНаградам.СрезПоследних(&НаДату, &УсловиеОтбора) КАК ПредставленияКНаградамСрезПоследних";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора", СтрСоединить(УсловияОтбора, НСтр("ru=' И '")));
	
	ПредставленияКНаградам = Запрос.Выполнить().Выгрузить();
	
	Возврат ПредставленияКНаградам;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегистраПодчиненногоРегистратору(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
